/**
	Игровой цикл - это обощённое представление потока событий, происходящих в игре.

	Игровой цикл:
		1. Установка параметров игры
		2. Получение пользовательского ввода
		3. Обновление внутреннего состояния игры
		4. Обновление изображения на экране
		5. Проверка того, не окончена ли игра

		*** Если игра не окончена, то возвращаемся в пункт № 2.

		6. Завершение
*/

int main() {
	// 1. Установка параметров игры
	
	do {
		// 2. Получение пользовательского ввода
		
		// 3. Обновление внутреннего состояния игры
		
		// 4. Обновление изображения на экране
		
	} while (/* 5. Проверка того, не окончена ли игра */ false);
	
	// 6. Завершение
	
}
